In [1]:
import numpy as np
import pandas as pd

In [4]:
m = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    19    29     9
1     4    16    21
2    25    25     9
3    29    27    17
4    12     3    11
5    11    16     4
6    15    22    27
7    18     7    26
8    25     1     5
9    27     7    14

In [5]:
#loc : used for choosing element

In [6]:
df.loc[0:3]

   var1  var2  var3
0    19    29     9
1     4    16    21
2    25    25     9
3    29    27    17

In [7]:
#iloc makes choose that we get used to.

In [8]:
df.iloc[0:3]

   var1  var2  var3
0    19    29     9
1     4    16    21
2    25    25     9

In [9]:
df.iloc[0,0]

19

In [10]:
df.iloc[:3,:2]

   var1  var2
0    19    29
1     4    16
2    25    25

In [13]:
df.loc[0:3,"var3"]

0     9
1    21
2     9
3    17
Name: var3, dtype: int32

In [19]:
df.iloc[0:4,2:4]["var3"]

0     9
1    21
2     9
3    17
Name: var3, dtype: int32

In [22]:
df["var1"][0:2]

0    19
1     4
Name: var1, dtype: int32

In [23]:
df[0:2]

   var1  var2  var3
0    19    29     9
1     4    16    21

In [24]:
df[0:2][["var1","var2"]]

   var1  var2
0    19    29
1     4    16

In [26]:
df[df.var1 > 20]

   var1  var2  var3
2    25    25     9
3    29    27    17
8    25     1     5
9    27     7    14

In [27]:
df[df.var1 > 10]["var1"]

0    19
2    25
3    29
4    12
5    11
6    15
7    18
8    25
9    27
Name: var1, dtype: int32

In [30]:
df[(df.var1 > 20) & (df.var3 < 10)]

   var1  var2  var3
2    25    25     9
8    25     1     5

In [31]:
df.loc[(df.var1 > 20),["var1","var2"]]

   var1  var2
2    25    25
3    29    27
8    25     1
9    27     7

In [32]:
df[(df.var1 > 20)][["var1","var2"]]

   var1  var2
2    25    25
3    29    27
8    25     1
9    27     7

In [33]:
import numpy as np
import pandas as pd

In [35]:
a = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(a,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     6    20     7
1    24    24     7
2    21    18    23
3     3    10     8
4    15    17    12
5    25    27    18
6     4     2    19
7    26    12    14
8    17    25    18
9    24     7    17

In [39]:
df.loc[0:3,["var1","var2"]]

   var1  var2
0     6    20
1    24    24
2    21    18
3     3    10

In [41]:
df.iloc[0:4,0:4]["var2"]

0    20
1    24
2    18
3    10
Name: var2, dtype: int32

In [43]:
df[0:4]["var2"]

0    20
1    24
2    18
3    10
Name: var2, dtype: int32

In [44]:
df.loc[0:3,"var2"]

0    20
1    24
2    18
3    10
Name: var2, dtype: int32

In [46]:
df[df.var1 > 20][["var2","var3"]]

   var1  var2
1    24    24
2    21    18
5    25    27
7    26    12
9    24     7

In [48]:
df.loc[df.var1 > 20,["var2","var3"]]

   var2  var3
1    24     7
2    18    23
5    27    18
7    12    14
9     7    17

In [49]:
df[(df.var1 > 20) & (df.var2 > 15) & (df.var3 > 20)]

   var1  var2  var3
2    21    18    23